<template>
      <SSMainItem :title="title" :use-context-margin="useContextMargin">
        <div class="ss-support-education">
          <p class="text-indent">半年时间能干什么，一年时间能干些什么呢，在这里你或许可以找到答案。</p>
          <p class="text-indent">他们是一群的纯真可爱的天使，在生活在蔚蓝的天空下，美丽的群山之中。但是同时，因为地区偏远，家庭条件，他们的教学环境却令人担忧。一些孩子都不曾离开过大山，不知道外面的世界是怎样的。我们的基础教育还很缺乏，山里的孩子们为了上学早上六点就得早起出发到学校，有的孩子上学之路不知要翻过几座山头。教学条件，教学设施也比较差。有些家长思想陈旧，家庭教育缺乏，很多担子给了学校。现在学校更是缺乏老师，需要能够来帮助我们孩子们的志愿者，孩子们真的需要你们。知识，孩子之望。</p>
          <p class="text-indent"> 此次我们团队受当地学校委托向社会招募2019-2020年度（最少一学期）长期支教老师。支教对象是位于湖南省和河北省的中小学共十所，支教地点学校师资紧张。我们团队致力于山区贫困地区的助学支教事业，深感山区孩子的困难，明白乡村教师的重要性，特希望有志者能够和我们一起，帮孩子找到一把打开世界大门的钥匙。</p>
          <div class="container">
            <div class="row">
              <div :class="{'col': schoolInfo.name,'w-100': !schoolInfo.name }" v-for="(schoolInfo,i) in schoolInfos" :key="i">
                <SchoolItem v-if="schoolInfo.name" v-bind="schoolInfo" />
              </div>
            </div>
          </div>
        </div>
      </SSMainItem>
</template>
<script>
export default {
    data: function(){
      return {
        title: "2019至2020年长期支教合作学校",
        useContextMargin: true,
        schoolInfosRaw:[
          {
            name: "炎陵县船形乡学校",
            imageUrl: "/img/page/support/school1.jpg",
            introduction: "学校位于炎陵县船形乡新生村，属于炎陵山区字校，距县域37公里，有高速公路学校门囗，交通方便。学校位于乡政府旁边，是一所衣村九年一贯制学校",
            jobOffers: "学校服务6个自然村，覆盖人囗0.9万人，学校环境优美，学生纯朴，教字氛围浓厚。现有在校 生500多人，11个教学班。在编教37人，我校本来教师偏少，2018年下期又有两个请产假的老 师，学校急雪招聘2名支教教师（物理、体育老师各1人）。"
          },
          {
            name: "炎陵县职业技术学校",
            imageUrl: "/img/page/support/school2.jpg",
            introduction: "学校位于炎陵昙霞阳镇井岗东路62号，是所公立职业技术学校。上一级管理单位：炎陵昙教育局。学 校服务炎陵昙全昙20万人，现有在校生470名，有10个教学班",
            jobOffers: "在編数师48人，我校本来专业教师少，本期又有两个教师借调到县里其他部门,孩子们急教 师。冒昧的提出申请，希望有心人士到我校支教，让山里的孩子们能字到更多的知识。我校还雯2多 支教教师（计算机专业、幼两专业教师各1人）。"
          },
          {
            name: "炎陵县炎陵中学",
            imageUrl: "/img/page/support/school3.jpg",
            introduction: "学校位于炎陵县县城书香路1号，是一所九年一贯制学校。上一级管理望位：陵县教育局，学校服务于 县城。现有在校生2463名，有51个教学班有在校教师137人。本期又有一个生病、掺假、退休人员。",
            jobOffers: "冒味的提出申清，希望有愛心人士到我校支教，让山里的孩子们能学到更多的知识，我校还需6名支教教师（语文、数学、物理、政治、地理）。"
          },
          {
            name: "炎陵县下村乡学校",
            imageUrl: "/img/page/support/school4.jpg",
            introduction: "学校位于炎陵县下村乡政府所在地同乐村，是一所九年制义务教育学校，离县城60公里，坡陡弯多，一个 半小时的车程。下村多与江西省遂川县交界，风景秀丽，气候宜人。学校现有在校生709名，有18个数学 班。教师制数是51人，而现有在编在岗教师37人，上学年已聘请代课教师、后勤服务人员十来人，本字学年又急需教师。",
            jobOffers: "希望有爱心人士到我校支教，让山里的孩子们能学到更多的知识，我校还需4名支教教师（语文、初中数学、初中化学、初中体育教师各1人）。"
          },
          {
            name: "炎陵县水口镇学校",
            imageUrl: "/img/page/support/school5.jpg",
            introduction: "学校位于炎陵县南片，距县城25公里，包括水口中学和水口中心小学两个校区，中学和小学都是农村寄宿制学校。学校服务12个自然村，覆盖人口1.8万人。现有在校生1300余名，有32个教学班。有在编教师83人，我校本来教师少，专业教师又不对口，二胎政策之后请产假的老师每学期都有，孩子们急需教师。",
            jobOffers: "冒味的提出申清，希望有愛心人士到我校支教，让山里的孩子们能学到更多的知识，我校还需8名支教教师（初中数学1名、初中物理1名、初中历史1名、初中英语1名、小学语文1名、小学数学名、小学英语1名、小学体育1名）"
          },
          {
            name: "炎陵县沔渡镇学校",
            imageUrl: "/img/page/support/school6.jpg",
            introduction: "学校坐落在炎陵县东北部，距县城15公里。学校下辖中学、中心小学、公办幼几园各一所，学校共有 27各教学讶，在校中小学生1137人，在职教师72人。我校教师编制紧，今年退休8人，3位女教师请 产假，一名教师请长期病假，下期开学急需补充教师。",
            jobOffers: "我校想通过多种渠道引进教师，希望有爱心人士到我校支教，以解学校缺教师之急，我校预计需7名支教教师（中学物理、生物、地理、数学各1人，小学语文、数学、英语各1人）"
          },
          {
            name: "鹿原镇学校",
            imageUrl: "/img/page/support/school7.jpg",
            introduction: "学校位于炎陵县炎帝陵旁，县政府所在地16公里。上一级管理单位：炎陵县教育局。学校服务14个自 村，覆盖人囗3万人。现有在校生290名，有个51个教学班，在编教师120人。",
            jobOffers: "冒昧的提出申请，希望有爱心人士到此支教。我校现需2名支教教师（数学、英语科目各1人）"
          },
          {
            name: "河南省南阳市方城县柳河乡孙沟学校",
            imageUrl: "/img/page/support/school8.jpg",
            introduction: "孙沟小学柳河乡政府所在地23里地，距县城100余里。路面水泥路面较多，路面窄，汇车困难，到县 城乘车需70分钟。学生来源主要来自字校周围方圆3公里内的10个自然村庄，都是走读生。留守儿童 占85％。现有幼儿大、中、小三个班，一到五年级，共八个教学班，在校学生192人。",
            jobOffers: "在编教师4人，主要教授语文数学课，缺少体音美，及专业幼儿教师，学校急需招募3位支教老师"
          },
          {
            name: "元宝小学",
            imageUrl: "/img/page/support/school9.jpg",
            introduction: "对江镇元宝小学位于国家级贫困县大方县城西20公里处的高山之上，所在属地为大方县对江镇元宝 村，属地以山高路陡，奇险异峻而闻名周边，属地村民早些年更是被山下村民称为“箐猴子”（意为深 山老林来的人）。元宝小学就是在这样的一个环境下诞生，上世纪80年代初，村里有识之士争取到了上级 支持，将原本零散分布于全村各村民组的私人办学点集中在较为中心的大果木组办学，统一由政府管理， 成立民办元宝小学。",
            jobOffers: "王小张和其妻子是学校的老师，比较重视学校教育。学校也有一位长期支教的老师，现特招募2位支教老师。"
          }
        ]
      }
    },
    computed:{
      schoolInfos:function(){
        let result = []
        this.schoolInfosRaw.forEach((v,i)=>{
          v.id = i + 1;
          result.push(v);
          if( (i + 1) % 2 == 0){
            result.push({});
          }
        });
        return result;
      }
    }
}
</script>
<style lang="scss" scoped>
.ss-support-education{
  font-size: $ssContentFontSize * 1.1;

}
.text-indent{
  text-indent: $ssContentFontSize * 1.1 * 2;
}
</style>