<template>
  <div>
    <SSMainItem :title="title" :use-context-margin="useContextMargin">
      <div class="ss-a-introduction m-0">
        <section>
        <p class="p1">梦之队支教助学中心，简称梦之队。是由重庆酷宝教育信息咨询服务有限公司成立的下属公益部门。</p>
        <p class="p1">
          团队致力于改善贫困落后地区教育状况，引导大学生以及社会人士关注乡村教育发展。通过网络面向全国招募志愿者，开展以春秋长期支教为主，寒暑假短期支教为辅的山区乡村志愿服务活动。梦之队于2016年2月成立，一直坚持服务于支教助学的项目和助医扶贫帮助，与社会上的爱心人士一同为山区儿童提供更多接受教育的机会，为他们带去来自这个世界的爱与希望。我们也希望在未来的日子里，能够坚持我们队伍“开启梦想成就梦想”的目标，携手有爱心的志愿者，致力于服务每一个山区儿童，创造梦想的奇迹。我们进行支教的目标是支援山区教学，强化山区孩子学习兴趣，提高他们的教学水平，关爱山区孩子的教育问题，让每一个适龄儿童，同沐温馨的阳光雨露，传播爱与希望，传播知识与梦想。
        </p>
        </section>
        <section>
        <h6 class="p2 ss-title-font">支教目的</h6>
        <p>（1） 我国西部教育发展相对落后，义务教育阶段表现为师资 力量比较薄弱、教学内容相对单一、教育的启发性不足，造成许多 学生没有受到较好的教育。我们想尽最大努力改善这种情况，因此成立梦之队公益支教进行支教活动；</p>
        <p>（2）传授除主修课以外的课外课程，培养孩子们的的课外兴趣，开展多元化课程，激发学生学习兴趣（学校暑假上课采取自愿制度，放假期间，孩子一般也是帮助家里做农活，若愿意来学校，接受语数外等主要课程的辅导，还能学到在大山之外的课程，在支教的同时，我们将对该地区小学的教育教学状况进行调查，以引起社会和政府更多的关注，对其情况改善提出合理性的建议）；</p>
        <p>（3）建立长期的校方支教地点，与学校保持联系，呼吁多方的支持，以捐赠图书用品等形式资助学生。</p>
        <p>（4）对学生学过的知识进行巩固，对一知半解的、不解的知识进行补习；对缺乏父爱母爱的学生进行陪伴和沟通开导；给学生们介绍他们向往的外面的世界，激发他们学习知识的热情；呼唤起当代人的社会责任感，给我们一个锻炼自己、奉献爱心的机会，给山里的孩子们切实的帮助，和他们建立友谊，为学习上和生活上有困扰的孩子们排忧解难，将来孩子们来到老师们所在的城市时，给他们提供一个视角和依靠。</p>
        </section>
      </div>
    </SSMainItem>
  </div>
</template>
<script>
export default {
    data: function(){
      return {
        title: "梦之队支教助学中心",
        useContextMargin: true
      }
    }
}
</script>
<style lang="scss" scoped>
.ss-a-introduction {
  font-size: $ssContentFontSize * 1.1;
  letter-spacing: 0.03rem;
  color: rgb(38, 38, 38);
}

.p1 {
  text-indent: 1.76rem;
}

.p2~p {
  text-indent: 0.88rem;
}

section {
  margin-top: 1rem;

  >p {
    margin-top: 0.25rem;
    ;
    margin-bottom: 0.25rem;
    ;
  }
}
</style>