<template>
  <div class="ss-offline-teaching">
    <SSMainItem :title="title1" :use-context-margin="useContextMargin">
      <div class="context-1">
      支教时间（暂定）：<br />
      每年寒假年前 ，暑假7月中旬至-8月中旬<br />
      支教内容：<br />
      <ol>
        <li>辅导学生的暑期作业，以基础知识巩固为主，辅以思维方式、学习习惯的教授；</li>
        <li>开展音乐、阅读、演讲、体育、手工、美术等多重多样的艺术类课程，丰富学生们的暑假生活，激发学生艺术天分；</li>
        <li>为山区的孩子们带去更多丰富世界的模样，展示美好世界，开阔其眼界，树立更积极向上的价值观；</li>
        <li>也欢迎志愿者们更好地发挥主观能动性，和我们一起开展更有意义的支教活动……</li>
      </ol>
      你是不是：<br />
      <ol>
        <li>对支教事业充满热情，并具有一定的了解，希望参与支教实践，积极向上乐于挑战；</li>
        <li>有很强的责任心，服从团队管理，能够坚持全程参与支教活动，并能够克服困难（支教过程中大多需要志愿者自己处理生活问题，如做饭洗衣服等，当然团队将互帮互助）；</li>
        <li>具有一定独立经济能力或获得家人的同意和支持（本次支教将以志愿者自费为主！！！），我们也会组织志愿者集体购买人身保险以保证支教活动顺利进行；</li>
        <li>对孩子有耐心（多为中小学阶段，6-16岁为主），具备一定的教学能力，具有教学相关经验者优先；</li>
        <li>有音乐、舞蹈、美术、摄影、写作等才艺者优先；</li>
        <li>年满十八岁，未满45岁（如果你不在此范围并认为年龄不是问题，欢迎报名参与，我们一定会酌情考虑）。</li>
      </ol>
      报名方式<br />
      加入梦之队QQ群（ 533246239  ），进群后在群文件中获取报名表，填写后发送至邮箱： 350291908@qq.com 。<br />
      报名截止时间请看报名表。<br />
      可以在报名表后添加关于个人资料的附件~<br /><br />
      志愿者须知：<br />
      <ol>
        <li>我们将根据志愿者报名表情况对志愿者进行筛选，并通知参与面试，面试将分为初试、复试两轮，分别针对志愿者的基本素养、教学能力进行考察；</li>
        <li>通过两轮面试后，我们将对志愿者进行若干次线上培训，志愿者需要认真参与每次培训，否则可能被取消参与资格哦；</li>
        <li>为确保志愿者参与度，我们将向预备队员收取一定的预备金（20-50元），如中途退出将不予退还，如无误参与支教工作，预备金将用于志愿者保险购买及队伍日常生活开支等，对内财政我们会保证公开透明；</li>
        <li>再次强调一下哦，我们的本次短期支教活动以志愿者自费为主；</li>
        <li>还有任何问题可以在群内进行咨询，但希望大家保持礼貌、相互理解，谢谢！梦之队欢迎您的加入~</li>
      </ol>
      </div>
    </SSMainItem>
    <SSMainItem :title="title2" :use-context-margin="useContextMargin">
      <div class="context-2">
        <div class="d-flex justify-content-lg-around">
          <img src="/img/pic2.png"/>
          <p class="">
            相关信息<br />
            报名截止时间：<br />
            每学期开学前十天截止<br />
            服务时间：<br />
            一学期起<br />
            支教地点：<br />
            湖南省株洲市炎陵县船形乡学校<br />
            湖南省株洲市炎陵县下村乡学校<br />
            湖南省株洲市炎陵县职业技术学校<br />
            湖南省株洲市炎陵县炎陵中学<br />
            湖南省株洲市炎陵县水口镇学校<br />
            湖南省株洲市炎陵县沔渡镇学校<br />
            湖南省株洲市炎陵县鹿原镇学校<br />
            贵州毕节市大方县对江镇元宝小学<br />
            河南省南阳市方城县柳河乡孙沟学校<br />
          </p>
        </div>
        <div>
          希望你<br />
          一、年满十八周岁，身体健康，认同组织管理理念，服从学校和队伍安排，具有一定的责任意识和突发事件处理能力；<br />
          二、至少保证能够支教一个学年，如因特殊情况提前离队，需先报备，协调安排后才可离开。<br />
          三、具有一定的经济能力，进行支教必须经得家人同意，协调好后报名。有去支教的物质基础，能够完成长期支教的教学任务，包括支教结束后，向支教组织和学校递交支教总结报告；<br />
          四、有一定的抗压能力和独立生活的能力，具有吃苦精神，在支教期间能够勤俭节约，做到自己洗衣做饭，完成生活大小事项；<br />
          五、富有爱心，能够公平、有爱地对待每一位学生；<br />
          六、具有学校要求相关学科教学能力；<br />
          七、具备良好的人际交往能力和适应能力，为人踏实、认真、善良，能很快适应并尊重当地的民风民俗、生活习惯、语言文化等；<br />
          八、支教期间公共器材设施使用时需向学校请示，不可随意乱用，或造成器材损坏；<br />
          九、具备团队意识和自我管理能力，严格规范自己，成为学生好榜样；<br />
          十、湖南地区要求有教师资格证的方可申报，其他地区无该条件限制。<br />
        </div>
      </div>
    </SSMainItem>
  </div>
</template>
<script>
export default {
    data: function(){
      return {
        title1: "寒暑假短期支教志愿者招募",
        title2: "春秋季长期支教志愿者招募",
        useContextMargin: true
      }
    }
}
</script>
<style lang="scss" scoped>
.ss-offline-teaching{
  font-size: $ssContentFontSize * 1.1;

  ol{
    list-style: none;
    padding-left: 0;
    counter-reset: xxx 0;
    > li::before{
      content: counter(xxx,decimal) "、";
      counter-increment: xxx 1;
    }
  }

  .context-2{
    > div{
      margin-bottom: 2rem;

      >img{
        height: 23.75rem;
      }
    }
  }
}
</style>