<template>
      <SSMainItem :title="title" :use-context-margin="useContextMargin">
        <div class="ss-officer">
          招新季</br>
          项目部干事</br>
          如果你希望加入项目部参与项目策划及组织，希望你有志愿活动的创新主意、策划的写作能力、活动的组织能力等技能，有大学组织或社会组织相关部门经历者优先</br>
          支教部干事</br>
          如果你希望加入支教部更近距离接触支教工作，希望你有一定教育、心理学等相关知识或懂得志愿者管理</br>
          宣传部干事</br>
          如果你希望加入宣传部参与团队日常宣传，希望你是懂宣传图/视频制作的技术咖，或有宣传文案等的写作文笔（报名时可附上相关作品）</br>
          外联部干事</br>
          如果你希望加入外联部，我们希望你有良好的沟通交流能力，能帮助我们团队与支教学校的沟通，联系，对外项目的洽谈等</br>
          财务部干事</br>
          如果你希望加入财务部，我们希望你认真细心，有相关财务统筹管理的经验和技能</br>
          <hr />
        
          我们需要</br>
          <ol>
            <li>热爱公益活动，充满爱心和责任心，认可梦之队的团队观；</li>
            <li>无论是大学生、社会工作者或更多社会身份都ok，你都能拥有一定空闲时间，能在团队内有参与感；</li>
            <li>如果以上技能你都对自己不满意，如果你有愿意学习的心，我们都欢迎哦♥</li>
          </ol>
          <hr />
          
          在这里你可以收获：</br>
          <ol>
            <li>遇见一群热爱公益的小伙伴，大家来自天南地北却朝着一个方向前进，大家分享故事、交流经验、共同成长；</li>
            <li>真正地参与到支教等公益活动中，看到自己小小的力量带给这个大大的世界地改变；</li>
            <li>在团队日常运营、项目开展过程中收获更多实践经验，或许还能get√一些有趣的新技能；</li>
            <li>正式加入团队参与工作一年及以上，并获得队友们一致认可后，你的履历上将多出“梦之队支教助学公益协会实习”一项，我们会提供实践证明；</li>
            <li>更多关于我们的福利欢迎前来发现~</li>
          </ol>
          <hr />

          招募流程</br>
          <ol>
            <li>扫描进群下载报名表，认真填写后发送至 229862763@qq.com ；</li>
            <li>我们将根据报名表择优进行面试通知，请静候通知；</li>
            <li>报名时间为即日起截至2018年12月02日；</li>
            <li>招募筛选将以淘汰制度进行，以报名表筛选、面试初试及面试复试三个阶段，最终通过复试后干事将接受梦之队培训；</li>
            <li>所有干事将通过实习期后成为优秀的正式成员。</li>
          </ol>
          <p>梦之队干事招募群：287327324</p>
        </div>
      </SSMainItem>
</template>
<script>
export default {
    data: function(){
      return {
        title: "梦之队干事招募需知",
        useContextMargin: true
      }
    }
}
</script>
<style lang="scss" scoped>
.ss-officer{
  font-size: $ssContentFontSize * 1.1;

  ol{
    list-style: none;
    padding-left: 0;
    counter-reset: xxx 0;
    > li::before{
      content: counter(xxx,decimal) "、";
      counter-increment: xxx 1;
    }
  }
}
</style>
</style>