<template>
    <div>
        <NewsMoreTab :datas="datas"/>
    </div>
</template>
<script>
export default {
  data: function () {
    return {
      "datas": [
      {
        name: "云教室2019年春季学期志愿者招募入选名单公布",
        url: "/te1/云教室2019年春季学期志愿者招募入选名单公布",
        time: "2018-12-31"
      },
      {
        name: "河南支教队石恺璐支教总结",
        url: "/te1/河南支教队石恺璐支教总结",
        time: "2018-12-31"
      },
      {
        name: "通告/关于文某违反梦之队纪律公告的通报",
        url: "/te1/通告/关于文某违反梦之队纪律公告的通报",
        time: "2018-12-11"
      },
      {
        name: "云教室2019年春季学期志愿者招募入选名单公布",
        url: "/te1/云教室2019年春季学期志愿者招募入选名单公布",
        time: "2018-11-28"
      },
      {
        name: "云教室2019春季学期线上志愿者招募",
        url: "/te1/云教室2019春季学期线上志愿者招募",
        time: "2018-11-28"
      },
      {
        name: "梦之队2018年秋季干事招募进行时",
        url: "/te1/梦之队2018年秋季干事招募进行时",
        time: "2018-11-15"
      },
      {
        name: "支教报道⑥| 第三支教队 赠人玫瑰，手留余香",
        url: "/te1/支教报道⑥| 第三支教队 赠人玫瑰，手留余香",
        time: "2018-08-06"
      },
      {
        name: "借梦想之翼，绘顺小蓝图 ——创客英语暑期支教",
        url: "/te1/梦之队2018年秋季干事招募进行时",
        time: "2018-08-03"
      },
      {
        name: "支教报道④| 防灾科技学院支教队 山水有清音，心间存爱意",
        url: "/te1/支教报道④| 防灾科技学院支教队 山水有清音，心间存爱意",
        time: "2018-07-31"
      },
      {
        name: "支教报道③| 第三支教队 希望初醒，青春依旧",
        url: "/te1/支教报道③| 第三支教队 希望初醒，青春依旧",
        time: "2018-07-29"
      }]
    };
  }
}
</script>
<style lang="scss" scoped>

</style>